In [1]:
import pandas as pd
import numpy as np

In [8]:
london_cal = pd.read_csv('./london_calendar.csv')

In [9]:
london_cal.head()

   listing_id        date available   price
0        9554  2019-11-25         t  $35.00
1        9554  2019-11-24         t  $35.00
2        9554  2019-11-23         t  $39.00
3        9554  2019-11-22         t  $39.00
4        9554  2019-11-21         t  $35.00

In [10]:
london_cal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28139675 entries, 0 to 28139674
Data columns (total 4 columns):
listing_id    int64
date          object
available     object
price         object
dtypes: int64(1), object(3)
memory usage: 858.8+ MB

In [14]:
london_cal.tail()

          listing_id        date available price
28139670    30587988  2018-12-11         f   NaN
28139671    30587988  2018-12-10         f   NaN
28139672    30587988  2018-12-09         f   NaN
28139673    30587988  2018-12-08         f   NaN
28139674    30587988  2018-12-07         f   NaN

In [15]:
london_cal.isnull().sum()

listing_id           0
date                 0
available            0
price         18671601
dtype: int64

In [19]:
#do some data cleaning exercise; remove the dollar sign
london_cal['price'] = london_cal.loc[:, 'price'].str.replace('$', '')
london_cal['price'] = london_cal.loc[:, 'price'].str.replace(',', '').astype(float)

In [20]:
london_cal.head()

   listing_id        date available  price
0        9554  2019-11-25         t   35.0
1        9554  2019-11-24         t   35.0
2        9554  2019-11-23         t   39.0
3        9554  2019-11-22         t   39.0
4        9554  2019-11-21         t   35.0

In [21]:
london_cal.tail()

          listing_id        date available  price
28139670    30587988  2018-12-11         f    NaN
28139671    30587988  2018-12-10         f    NaN
28139672    30587988  2018-12-09         f    NaN
28139673    30587988  2018-12-08         f    NaN
28139674    30587988  2018-12-07         f    NaN

In [22]:
#in order to take of the nan we need to get the avearage price
london_cal['price'].mean()

138.05469443943932

In [25]:
#fill the missing values under price with the average price value
london_cal.fillna(london_cal['price'].mean(), inplace= True)

In [27]:
london_cal.isnull().sum()

listing_id    0
date          0
available     0
price         0
dtype: int64

In [29]:
london_cal.to_csv('clean_london_calendar.csv', index=False)